import React from 'react';
import { Collapse } from 'antd';

const ProgressTask_FUser = () => {

    const items1Answer = [
        {
            key: '1',
            label: 'نظر شما',
            children:
                <p>
                    در نزدیکترین مناطق به Kaleici و ساحل Konyaalti بمانید... آنها در  طول هم اند و بسیار نزدیک خطوط تراموا هستند. به علاوه بهترین مراکز غذای خوب در یک مکان اند.
                    بلک بسیار کسل کننده است مگر اینکه خانواده ای باشید که قصد خروج از استراحتگاه ها را ندارید.

                </p>,
        }
    ];

    const items2Answer = [
        {
            key: '1',
            label: 'نظر شما',
            children:
                <p>
                    شهر قدیمی، که به نام ایچری شهر نیز شناخته می‌شود، امن‌ترین منطقه برای گردشگران است. این مکان جزو میراث جهانی یونسکو است و فضای تاریخی به خوبی در آن حفظ شده. با خیابان های باریک و دیوارهای باستانی، این منطقه به شدت تحت نظارت است و حضور پلیس قوی دارد و محیط امنی را برای بازدیدکنندگان تضمین می کند.
                </p>,
        }
    ];

    const items3Answer = [
        {
            key: '1',
            label: 'نظر شما',
            children:
                <p>
                    این یک فرصت عالی برای من به نظر می رسد. مگر اینکه در حال حاضر یک پیشنهاد نقش رسمی روی میز داشته باشید. من همچنین از آنجایی که سؤالات شما حاکی از درک نسبتاً پایینی از سیستم دانشگاهی است، ممکن است تا به حال توصیه یا راهنمایی زیادی به شما نشده باشد. پیشنهاد می‌کنم با پرسیدن سؤالات زیادی از همکاران و تحقیق در مورد نحوه عملکرد سیستم از طریق وبلاگ‌ها و غیره، این موضوع را بسیار اولویت‌بندی کنید. همه اینها قضاوت شما را نشان می‌دهد که برای پیشرفت شما در این بخش حیاتی است.
                </p>,
        }
    ];

    const items4Answer = [
        {
            key: '1',
            label: 'نظر شما',
            children:
                <p>
                    استخدام وکیل مهاجرت می تواند به طور قابل توجهی به پرونده شما در هنگام درخواست ویزای تحصیلی برای مهاجرت به آلمان کمک کند. قوانین و رویه های مهاجرت می توانند پیچیده و قابل تغییر باشند و داشتن یک متخصص مجرب شما را در این فرآیند راهنمایی می کند می تواند خطاها را به حداقل برساند و شانس موفقیت شما را افزایش دهد. یک وکیل اطمینان حاصل می کند که تمام مدارک لازم به درستی آماده شده است، به تکمیل فرم های درخواست کمک می کند و به شما در درک الزامات قانونی و تعهدات مرتبط با ویزای دانشجویی کمک می کند. آنها همچنین می توانند بر اساس شرایط خاص شما، مانند ملاحظات مالی، مهارت زبان و فرصت های شغلی بالقوه، مشاوره شخصی ارائه دهند. با سپردن پرونده خود به وکیل مهاجرت، می توانید با خیال راحت و با خیالی آسوده روند درخواست ویزا را طی کنید.
                </p>,
        }
    ];

    const items5Answer = [
        {
            key: '1',
            label: 'نظر شما',
            children:
                <p>
                    هنگام در نظر گرفتن مهاجرت به کشورهای اروپای شرقی با استفاده از ویزای کار، باید روی کشورهایی تمرکز کنید که فرصت های مالی قوی ارائه می دهند. به دنبال کشورهایی با اقتصاد در حال رشد، تقاضا برای کارگران ماهر در رشته خود و چشم انداز شغلی مطلوب باشید. کشورهایی مانند لهستان، مجارستان یا جمهوری چک را که رشد اقتصادی قابل توجهی در سال‌های اخیر تجربه کرده‌اند و دستمزدهای رقابتی ارائه می‌دهند، تحقیق کنید. صنایعی را کاوش کنید که با مهارت ها و صلاحیت های شما همسو هستند تا مناطق یا شهرهایی را در این کشورها شناسایی کنید که بازار کار پر رونقی در رشته شما دارند. علاوه بر این، عواملی مانند هزینه زندگی، مزایای مراقبت های بهداشتی و پتانسیل پیشرفت شغلی را در نظر بگیرید. با اولویت بندی کشورهایی با چشم انداز مالی امیدوار کننده، شانس خود را برای یافتن فرصت های شغلی مفید و ساختن آینده ای با ثبات افزایش می دهید.
                </p>,
        }
    ];

    const items6Answer = [
        {
            key: '1',
            label: 'نظر شما',
            children:
                <p>
                    مهندسی کامپیوتر بهتر یا بدتر از علوم کامپیوتر نیست، فقط متفاوت است، اما با مقدار زیادی همپوشانی. به طور کلی، مهندسی کامپیوتر بیشتر در مورد سخت افزار است. اگر به چیزهایی مانند روباتیک، هواپیماهای بدون سرنشین، شبکه، کارت های گرافیک، لوازم جانبی USB یا هر چیز دیگری در این زمینه علاقه دارید، ممکن است مهندسی کامپیوتر را دوست داشته باشید. اگر بیشتر به ساخت برنامه ها، بازی ها، وب سایت ها یا حل مشکلات علاقه دارید، ممکن است علوم کامپیوتر را دوست داشته باشید.
                    در هر دوی آنها برنامه نویسی زیادی انجام خواهید داد.
                    به طور کلی افراد بیشتری CS را انجام می دهند، این هنوز هم بزرگترین رشته برای افرادی است که در یک شرکت فناوری مشغول به کار برنامه نویسی هستند.

                </p>,
        }
    ];



    const items = [
        {
            key: '1',
            label:
                <p>
                    <span style={{ fontSize: '16pt', fontWeight: 'bold' }}>سفر</span> <br />
                    سلام، من و سه نفر از دوستانم (۲۳ ساله) قصد داریم به مدت سه شب در شهر آنتالیا ترکیه بمانیم و دنبال مناسب ترین قسمت شهر برای هتل گرفتن هستیم. معیار های ما :
                    نزدیک به مرکز شهر باشد.
                    زندگی شبانه برایمان مهم نیست.
                    دوست داریم مکان های تاریخی را ببینیم و برایمان خرید و کافی شاپ مهم نیست.
                    غذا برایمان خیلی مهم است و ترجیحا نزدیک ساحل باشد.
                    ممنون میشوم به ما در این تصمیم کمک کنید.
                </p>,
            children: <Collapse accordion items={items1Answer} />,
        },
        {
            key: '2',
            label:
                <p>
                    <span style={{ fontSize: '16pt', fontWeight: 'bold' }}>سفر</span> <br />
                    سلام، من قرار است ماه آینده به باکو در آذربایجان سفر کنم ولی از نظر امنیت مکانی که قرار است بمانم نگران هستم و دنبال امن ترین مکان ها در باکو برای توریست ها هستم.
                </p>
            ,
            children: <Collapse accordion items={items2Answer} />,
        },
        {
            key: '3',
            label:
                <p>
                    <span style={{ fontSize: '16pt', fontWeight: 'bold' }}>تحصیلی</span> <br />
                    من در سال آخر دکترای خود (علوم اعصاب) هستم و این فرصت به من داده شده است که پس از اتمام، وارد دوره فوق دکتری بشوم. من واقعاً کل حرفه پسادکتری/آکادمیک را دقیقاً درک نمی‌کنم و اکثراً گفته‌اند که می‌تواند یک بن‌بست باشد. با این حال برای من جالب است زیرا می توانم روی برخی تحقیقاتی که همیشه شیفته آنها بوده ام کار کنم. لطفا نظرات تان را در اینباره بنویسید.
                </p>
            ,
            children: <Collapse accordion items={items3Answer} />,
        },
        {
            key: '4',
            label:
                <p>
                    <span style={{ fontSize: '16pt', fontWeight: 'bold' }}>مهاجرت</span> <br />
                    سلام. من قصد دارم از طریق ویزای دانشجویی به آلمان مهاجرت کنم ولی نمیدانم در این پروسه از وکیل استفاده کنم یا خودم کار ها را جلو ببرم. لطفا در این تصمیم به من کمک کنید.
                </p>
            ,
            children: <Collapse accordion items={items4Answer} />,
        },
        {
            key: '5',
            label:
                <p>
                    <span style={{ fontSize: '16pt', fontWeight: 'bold' }}>مهاجرت</span> <br />
                    سلام. من قصد مهاجرت از طریق ویزای کاری دارم و نظرم بیشتر روی کشور های شرق اروپا است. اما نمیتوانم تصمیم بگیرم که روی کدام کشور بیشتر سرمایه گذاری کنم. لطفا در این تصمیم به من کمک کنید.
                </p>
            ,
            children: <Collapse accordion items={items5Answer} />,
        },
        {
            key: '6',
            label:
                <p>
                    <span style={{ fontSize: '16pt', fontWeight: 'bold' }}>تحصیلی</span> <br />
                    من به زودی به دانشگاه می روم و در این فکر بودم که کدام یک بهتر است: علوم کامپیوتر یا مهندسی کامپیوتر؟ من هر دو را دوست دارم، اما ترجیح می دهم با سخت افزار کار کنم، اما با توجه به آنچه که من دیدم، همه به نرم افزار ختم می شوند و صادقانه بگویم، پول بیشتری در نرم افزار وجود دارد.
                </p>
            ,
            children: <Collapse accordion items={items6Answer} />,
        }
    ];

    return (
        <div>
            <Collapse accordion items={items} />
        </div>
    )
}

export default ProgressTask_FUser;