import React from 'react';
import { Collapse } from 'antd';

const ProgressTask = () => {

    const items1Answer = [
        {
            key: '1',
            label: 'نظر اول',
            children:
                <p>
                    در نزدیکترین مناطق به Kaleici و ساحل Konyaalti بمانید... آنها در  طول هم اند و بسیار نزدیک خطوط تراموا هستند. به علاوه بهترین مراکز غذای خوب در یک مکان اند.
                    بلک بسیار کسل کننده است مگر اینکه خانواده ای باشید که قصد خروج از استراحتگاه ها را ندارید.

                </p>,
        },
        {
            key: '2',
            label: 'نظر دوم',
            children:
                <p>
                    Kaleiçi (شهر قدیمی): کافه‌ها، بارها، موسیقی زنده با جمعیت، جاده‌های قدیمی شهر و بندر تاریخی با گشت‌های روزانه با قایق
                    ساحل کنیالتی: ساحل کنیالتی به طول حدود 15 کیلومتر، کافه‌ها و مکان‌های دنج، جاده دوچرخه‌سواری، مناسب برای شنا و پیاده‌روی و نشستن در ساحل ، نزدیک میدان شهر کونیالتی بمانید تا بتوانید به رستوران های خوب و استارباکس برسید. پل Bogacayi برای پیاده روی زیبا و مناظر خوب غروب آفتاب.

                    لارا: مکان‌های لوکس و دنج با هم، منظره تپه‌های زیبا در نزدیکی دریا اما فقط سواحل صخره‌ای، برای دوچرخه‌سواری و پیاده‌روی مناسب است (بهتر از کونیالتی). پارک های خوبی مانند دودن پارک (پارک آبشاری)
                </p>,
        },
        {
            key: '3',
            label: 'نظر سوم',
            children:
                <p>
                    با توجه به آنچه ذکر کردید، اقامت در ساحل کنیالتی و اجاره ماشین (که می توانید با حداقل 500 لیر در روز پیدا کنید) را برای رفتن به مرکز شهر (حدود 20 دقیقه دورتر) و کاوش در مکان های تاریخی اطراف آنتالیا مانند آسپندوس توصیه می کنم. بازدید از موزه ها و پارک ها. زمان انتظار اتوبوس های عمومی زیاد است و گرمای هوا در ماه های تابستان غیر قابل تحمل است.
                </p>
        }
    ];

    const items2Answer = [
        {
            key: '1',
            label: 'نظر اول',
            children:
                <p>
                    شهر قدیمی، که به نام ایچری شهر نیز شناخته می‌شود، امن‌ترین منطقه برای گردشگران است. این مکان جزو میراث جهانی یونسکو است و فضای تاریخی به خوبی در آن حفظ شده. با خیابان های باریک و دیوارهای باستانی، این منطقه به شدت تحت نظارت است و حضور پلیس قوی دارد و محیط امنی را برای بازدیدکنندگان تضمین می کند.
                </p>,
        },
        {
            key: '2',
            label: 'نظر دوم',
            children:
                <p>
                    منطقه مرکز شهر، به ویژه در اطراف میدان فواره و خیابان نظامی را پیشنهاد میکنم. این منطقه تجاری شلوغ مملو از فروشگاه‌ها، رستوران‌ها، و مکان‌های تفریحی است. اغلب شلوغ است و به خوبی گشت زنی می شود و احساس امنیت را برای گردشگران ایجاد می کند. علاوه بر این، این منطقه به خوبی به حمل و نقل عمومی متصل است و آن را برای کاوش در سایر نقاط شهر راحت می کند.
                </p>,
        },
        {
            key: '3',
            label: 'نظر سوم',
            children:
                <p>
                    به نظر من منطقه نسیمی به عنوان پناهگاهی امن برای گردشگران در نظر گرفته می‌شود. نسیمی به دلیل امکانات بین المللی از جمله رستوران ها، هتل ها و مراکز خرید، در بین مهاجران و خارجی های مقیم باکو محبوب است. این منطقه میزان جرم و جنایت کمتری دارد و محیطی جهانی ارائه می‌کند و جمعیت متنوعی را به خود جذب می‌کند.
                </p>
        }
    ];

    const items3Answer = [
        {
            key: '1',
            label: 'نظر اول',
            children:
                <p>
                    این یک فرصت عالی برای من به نظر می رسد. مگر اینکه در حال حاضر یک پیشنهاد نقش رسمی روی میز داشته باشید. من همچنین از آنجایی که سؤالات شما حاکی از درک نسبتاً پایینی از سیستم دانشگاهی است، ممکن است تا به حال توصیه یا راهنمایی زیادی به شما نشده باشد. پیشنهاد می‌کنم با پرسیدن سؤالات زیادی از همکاران و تحقیق در مورد نحوه عملکرد سیستم از طریق وبلاگ‌ها و غیره، این موضوع را بسیار اولویت‌بندی کنید. همه اینها قضاوت شما را نشان می‌دهد که برای پیشرفت شما در این بخش حیاتی است.
                </p>,
        },
        {
            key: '2',
            label: 'نظر دوم',
            children:
                <p>
                    چند سوال وجود دارد که باید بپرسید:
                    تامین مالی چقدر امن است؟ ممکن است PI شما قصد داشته باشد شما را برای 2-3 سال استخدام کند، اما ممکن است اکنون فقط بودجه ای برای نگه داشتن شما برای یک سال داشته باشد. در مورد این وارد شدن شفاف باشید.
                    در چه مرحله ای از شما انتظار می رود که برای کمک هزینه ها/ کمک هزینه های تحصیلی خود درخواست دهید؟ پاسخ به احتمال زیاد، دوباره، "فورا" است، اما ارزش آن را دارد که انتظارات را روشن کنیم. در رابطه با نکته یک، اگر نتوانید بودجه خود را تامین کنید، آیا PI شما بودجه لازم برای حمایت از شما را دارد؟
                    بودجه این آزمایشگاه چقدر است؟ آیا به معرف‌هایی که نیاز دارید دسترسی خواهید داشت، می‌توانید آزمایش‌های گران قیمتی انجام دهید، یا اینکه آزمایشگاه با بودجه‌ای کم کار می‌کند، حتی اگر حقوق‌ها مطمئن باشند؟
                    و سوالات معمول در مورد محیط تحقیق، فرهنگ آزمایشگاهی و غیره

                </p>,
        },
        {
            key: '3',
            label: 'نظر سوم',
            children:
                <p>
                    آیا قصد دارید در دانشگاه بمانید؟
                    اگر چنین است، من به شدت توصیه می کنم پسادکتری انجام دهید. این فشار زیادی را در طول جستجوی کار اولیه از شما می گیرد. و همانطور که احتمالاً از طریق پاسخ‌های این تاپیک متوجه خواهید شد، انتظارات و روش‌های تأمین مالی فوق‌دکترها بسیار متفاوت است، من دو دوره پساداک را در دو موسسه مختلف انجام دادم، و حتی آنها متفاوت بودند.
                    مدارک پست من عمدتاً مدارسی بودند که به من پول می دادند تا به نام آنها تحقیق کنم، در حالی که من مجبور نبودم چیزی تدریس کنم، و هیچ کس فوق العاده نگران نحوه گذراندن ساعات روزم نبود. این فوق العاده بود، به طور جدی، دو بهترین "شغل" که تا به حال داشته ام.

                </p>
        }
    ];

    const items4Answer = [
        {
            key: '1',
            label: 'نظر اول',
            children:
                <p>
                    استخدام وکیل مهاجرت می تواند به طور قابل توجهی به پرونده شما در هنگام درخواست ویزای تحصیلی برای مهاجرت به آلمان کمک کند. قوانین و رویه های مهاجرت می توانند پیچیده و قابل تغییر باشند و داشتن یک متخصص مجرب شما را در این فرآیند راهنمایی می کند می تواند خطاها را به حداقل برساند و شانس موفقیت شما را افزایش دهد. یک وکیل اطمینان حاصل می کند که تمام مدارک لازم به درستی آماده شده است، به تکمیل فرم های درخواست کمک می کند و به شما در درک الزامات قانونی و تعهدات مرتبط با ویزای دانشجویی کمک می کند. آنها همچنین می توانند بر اساس شرایط خاص شما، مانند ملاحظات مالی، مهارت زبان و فرصت های شغلی بالقوه، مشاوره شخصی ارائه دهند. با سپردن پرونده خود به وکیل مهاجرت، می توانید با خیال راحت و با خیالی آسوده روند درخواست ویزا را طی کنید.
                </p>,
        },
        {
            key: '2',
            label: 'نظر دوم',
            children:
                <p>
                    در حالی که استخدام وکیل می تواند مزایای خاصی را به همراه داشته باشد، این امکان وجود دارد که فرآیند درخواست ویزای دانشجویی برای مهاجرت به آلمان را به تنهایی طی کنید. مقامات مهاجرت آلمان دستورالعمل ها و منابع روشنی را برای کمک به متقاضیان در درک الزامات و رویه ها ارائه می دهند. با تحقیق کامل در مورد فرآیند درخواست ویزا، بررسی وب سایت های رسمی دولتی و دسترسی به منابع اطلاعاتی قابل اعتماد مانند وب سایت های سفارت ها یا کنسولگری ها شروع کنید. تمام مدارک لازم را جمع آوری کنید و مطمئن شوید که معیارهای مشخص شده را برآورده می کنند. اگر سوال خاصی دارید، برای شفاف سازی با مقامات یا سازمان های مربوطه تماس بگیرید. علاوه بر این، از انجمن‌ها یا انجمن‌های دانشجویی آلمانی کمک بگیرید تا بتوانید با افرادی که خود این فرآیند را طی کرده‌اند ارتباط برقرار کنید. با صرف زمان و تلاش برای درک الزامات و پیروی مجدانه دستورالعمل ها، می توانید با موفقیت بدون نیاز به وکیل برای ویزای دانشجویی اقدام کنید.
                </p>,
        },
        {
            key: '3',
            label: 'نظر سوم',
            children:
                <p>
                    تصمیم گیری در مورد استخدام وکیل یا رسیدگی به فرآیند درخواست ویزای دانشجویی نیاز به بررسی دقیق دارد. در حالی که امکان هدایت فرآیند به طور مستقل وجود دارد، داشتن یک وکیل می تواند پشتیبانی ارزشمندی را ارائه دهد، به خصوص اگر شرایط یا نگرانی های پیچیده ای دارید. اگر پرونده ای ساده و بدون هیچ مانع مهمی دارید، مانند موانع زبانی یا مسائل قبلی مهاجرت، ممکن است در ادامه بدون کمک قانونی احساس اطمینان کنید. با این حال، اگر نگرانی خاصی دارید، یک وکیل می تواند مشاوره تخصصی ارائه دهد، اسناد شما را بررسی کند و اطمینان حاصل کند که همه شرایط را برآورده می کنید. علاوه بر این، یک وکیل می تواند در رسیدگی به هرگونه چالش غیرمنتظره ای که ممکن است در طول فرآیند ایجاد شود کمک کند. هنگام تصمیم گیری، سطح راحتی، محدودیت های زمانی و پیچیدگی موقعیت خود را در نظر بگیرید. در نهایت، ایجاد تعادل بین خودکفایی با راهنمایی های حرفه ای می تواند به تضمین روند درخواست ویزای دانشجویی روان و موفق کمک کند.
                </p>
        }
    ];

    const items5Answer = [
        {
            key: '1',
            label: 'نظر اول',
            children:
                <p>
                    هنگام در نظر گرفتن مهاجرت به کشورهای اروپای شرقی با استفاده از ویزای کار، باید روی کشورهایی تمرکز کنید که فرصت های مالی قوی ارائه می دهند. به دنبال کشورهایی با اقتصاد در حال رشد، تقاضا برای کارگران ماهر در رشته خود و چشم انداز شغلی مطلوب باشید. کشورهایی مانند لهستان، مجارستان یا جمهوری چک را که رشد اقتصادی قابل توجهی در سال‌های اخیر تجربه کرده‌اند و دستمزدهای رقابتی ارائه می‌دهند، تحقیق کنید. صنایعی را کاوش کنید که با مهارت ها و صلاحیت های شما همسو هستند تا مناطق یا شهرهایی را در این کشورها شناسایی کنید که بازار کار پر رونقی در رشته شما دارند. علاوه بر این، عواملی مانند هزینه زندگی، مزایای مراقبت های بهداشتی و پتانسیل پیشرفت شغلی را در نظر بگیرید. با اولویت بندی کشورهایی با چشم انداز مالی امیدوار کننده، شانس خود را برای یافتن فرصت های شغلی مفید و ساختن آینده ای با ثبات افزایش می دهید.
                </p>,
        },
        {
            key: '2',
            label: 'نظر دوم',
            children:
                <p>
                    مهاجرت به یک کشور جدید فراتر از ملاحظات مالی است. اولویت دادن به تناسب فرهنگی و ترجیحات شخصی مهم است. درباره کشورهای اروپای شرقی از نظر فرهنگ، زبان، سبک زندگی و محیط اجتماعی آنها تحقیق کنید. عواملی مانند آب و هوا، آداب و رسوم محلی و کیفیت زندگی را در نظر بگیرید تا مکانی را پیدا کنید که در آن احساس راحتی کنید و بتوانید به راحتی یکپارچه شوید. کشورهایی مانند رومانی، بلغارستان یا اسلواکی را که به خاطر تاریخ غنی، زیبایی طبیعی و جوامع خوش‌آوازه‌شان شناخته شده‌اند، کاوش کنید. با جوامع محلی مهاجرین یا انجمن های آنلاین ارتباط برقرار کنید تا بینش هایی در مورد زندگی روزمره، فرهنگ کاری و فرصت های اجتماعی موجود در هر کشور به دست آورید. با اولویت دادن به کشوری که با علایق و ارزش های فرهنگی شما همسو باشد، احتمال لذت بردن از یک تجربه کامل و معنادار به عنوان یک مهاجر را افزایش می دهید.
                </p>,
        },
        {
            key: '3',
            label: 'نظر سوم',
            children:
                <p>
                    تعادل بین کار و زندگی جنبه مهمی است که باید هنگام انتخاب کشور اروپای شرقی برای تمرکز بر روی مهاجرت از طریق ویزای کار در نظر گرفت. به دنبال کشورهایی باشید که تعادل سالمی بین فرصت های حرفه ای و کیفیت زندگی ارائه می دهند. کشورهایی مانند استونی، اسلوونی یا لیتوانی به دلیل تعادل عالی بین کار و زندگی شناخته شده‌اند و فرصت‌هایی را برای رشد شغلی فراهم می‌کنند و در عین حال استاندارد بالای زندگی را تضمین می‌کنند. عواملی مانند ساعات کاری انعطاف پذیر، سیاست های تعطیلات، سیستم های مراقبت های بهداشتی و دسترسی به فعالیت های تفریحی را در نظر بگیرید. در مورد شهرهایی تحقیق کنید که رفاه را در اولویت قرار می دهند و محیطی حمایتی برای توسعه شخصی و حرفه ای فراهم می کنند. علاوه بر این، اگر افراد تحت تکفل دارید، سیستم آموزشی را در نظر بگیرید، زیرا گزینه های آموزشی با کیفیت برای خانواده ها مهم هستند. با اولویت بندی کشوری که به تعادل بین کار و زندگی اهمیت می دهد، می توانید در عین حال که اهداف شغلی خود را دنبال می کنید، به یک سبک زندگی رضایت بخش و هماهنگ دست یابید.
                </p>
        }
    ];

    const items6Answer = [
        {
            key: '1',
            label: 'نظر اول',
            children:
                <p>
                    مهندسی کامپیوتر بهتر یا بدتر از علوم کامپیوتر نیست، فقط متفاوت است، اما با مقدار زیادی همپوشانی. به طور کلی، مهندسی کامپیوتر بیشتر در مورد سخت افزار است. اگر به چیزهایی مانند روباتیک، هواپیماهای بدون سرنشین، شبکه، کارت های گرافیک، لوازم جانبی USB یا هر چیز دیگری در این زمینه علاقه دارید، ممکن است مهندسی کامپیوتر را دوست داشته باشید. اگر بیشتر به ساخت برنامه ها، بازی ها، وب سایت ها یا حل مشکلات علاقه دارید، ممکن است علوم کامپیوتر را دوست داشته باشید.
                    در هر دوی آنها برنامه نویسی زیادی انجام خواهید داد.
                    به طور کلی افراد بیشتری CS را انجام می دهند، این هنوز هم بزرگترین رشته برای افرادی است که در یک شرکت فناوری مشغول به کار برنامه نویسی هستند.

                </p>,
        },
        {
            key: '2',
            label: 'نظر دوم',
            children:
                <p>
                    مهندسی کامپیوتر و علوم کامپیوتر هر دو رشته های بسیار معتبر، مفید، تثبیت شده و دارای بودجه خوبی هستند. هیچ‌کدام از نظر معنادار «بهتر» نیستند.
                    اگر فقط به حقوق علاقه مند هستید، برنامه نویسی را یاد بگیرید و روی توسعه نرم افزار تمرکز کنید: دانشگاه ها برنامه هایی می سازند که دانشمندان و محققان را آموزش دهند. برنامه نویسی اولویت بالایی ندارد و اکثر دانشجویان کارشناسی ارشد تازه وارد دانشگاه، برنامه نویسان بدی هستند.

                </p>,
        },
        {
            key: '3',
            label: 'نظر سوم',
            children:
                <p>
                    اگر فقط مدرک لیسانس بگیرید، تفاوت زیادی ایجاد نمی کند. هر یک از این گزینه ها برای یافتن شغل در هر جایی به عنوان توسعه نرم افزار کافی است - و به نظر می رسد که این نگرانی اصلی شما باشد.
                </p>
        }
    ];



    const items = [
        {
            key: '1',
            label:
                <p>
                    <span style={{ fontSize: '16pt', fontWeight: 'bold' }}>سفر</span> <br />
                    سلام، من و سه نفر از دوستانم (۲۳ ساله) قصد داریم به مدت سه شب در شهر آنتالیا ترکیه بمانیم و دنبال مناسب ترین قسمت شهر برای هتل گرفتن هستیم. معیار های ما :
                    نزدیک به مرکز شهر باشد.
                    زندگی شبانه برایمان مهم نیست.
                    دوست داریم مکان های تاریخی را ببینیم و برایمان خرید و کافی شاپ مهم نیست.
                    غذا برایمان خیلی مهم است و ترجیحا نزدیک ساحل باشد.
                    ممنون میشوم به ما در این تصمیم کمک کنید.
                </p>,
            children: <Collapse accordion items={items1Answer} />,
        },
        {
            key: '2',
            label:
                <p>
                    <span style={{ fontSize: '16pt', fontWeight: 'bold' }}>سفر</span> <br />
                    سلام، من قرار است ماه آینده به باکو در آذربایجان سفر کنم ولی از نظر امنیت مکانی که قرار است بمانم نگران هستم و دنبال امن ترین مکان ها در باکو برای توریست ها هستم.
                </p>
            ,
            children: <Collapse accordion items={items2Answer} />,
        },
        {
            key: '3',
            label:
                <p>
                    <span style={{ fontSize: '16pt', fontWeight: 'bold' }}>تحصیلی</span> <br />
                    من در سال آخر دکترای خود (علوم اعصاب) هستم و این فرصت به من داده شده است که پس از اتمام، وارد دوره فوق دکتری بشوم. من واقعاً کل حرفه پسادکتری/آکادمیک را دقیقاً درک نمی‌کنم و اکثراً گفته‌اند که می‌تواند یک بن‌بست باشد. با این حال برای من جالب است زیرا می توانم روی برخی تحقیقاتی که همیشه شیفته آنها بوده ام کار کنم. لطفا نظرات تان را در اینباره بنویسید.
                </p>
            ,
            children: <Collapse accordion items={items3Answer} />,
        },
        {
            key: '4',
            label:
                <p>
                    <span style={{ fontSize: '16pt', fontWeight: 'bold' }}>مهاجرت</span> <br />
                    سلام. من قصد دارم از طریق ویزای دانشجویی به آلمان مهاجرت کنم ولی نمیدانم در این پروسه از وکیل استفاده کنم یا خودم کار ها را جلو ببرم. لطفا در این تصمیم به من کمک کنید.
                </p>
            ,
            children: <Collapse accordion items={items4Answer} />,
        },
        {
            key: '5',
            label:
                <p>
                    <span style={{ fontSize: '16pt', fontWeight: 'bold' }}>مهاجرت</span> <br />
                    سلام. من قصد مهاجرت از طریق ویزای کاری دارم و نظرم بیشتر روی کشور های شرق اروپا است. اما نمیتوانم تصمیم بگیرم که روی کدام کشور بیشتر سرمایه گذاری کنم. لطفا در این تصمیم به من کمک کنید.
                </p>
            ,
            children: <Collapse accordion items={items5Answer} />,
        },
        {
            key: '6',
            label:
                <p>
                    <span style={{ fontSize: '16pt', fontWeight: 'bold' }}>تحصیلی</span> <br />
                    من به زودی به دانشگاه می روم و در این فکر بودم که کدام یک بهتر است: علوم کامپیوتر یا مهندسی کامپیوتر؟ من هر دو را دوست دارم، اما ترجیح می دهم با سخت افزار کار کنم، اما با توجه به آنچه که من دیدم، همه به نرم افزار ختم می شوند و صادقانه بگویم، پول بیشتری در نرم افزار وجود دارد.
                </p>
            ,
            children: <Collapse accordion items={items6Answer} />,
        }
    ];

    return (
        <div>
            <Collapse accordion items={items} />
        </div>
    )
}

export default ProgressTask